In [2]:
import pandas

In [4]:
import pandas as pd

In [6]:
pd

In [8]:
import numpy as np
import pandas as pd

In [10]:
pd.Series(np.array([1,2,3,4]))

0    1
1    2
2    3
3    4
dtype: int32

In [12]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [14]:
a = [1,2,3,4]

In [16]:
pd.Series(a)

0    1
1    2
2    3
3    4
dtype: int64

In [18]:
a = pd.Series(a)
type(a)

pandas.core.series.Series

In [20]:
# dataframe 자료구조

In [21]:
# 방법1. list로 만들기

In [28]:
company1 = [ ['삼성', 2000, '스마트폰'],
             ['현대', 2500, '자동차'],
             ['금성', 3000, '건조기']
           ]

In [29]:
pd.DataFrame(company1)

    0     1     2
0  삼성  2000  스마트폰
1  현대  2500   자동차
2  금성  3000   건조기

In [30]:
df1 = pd.DataFrame(company1)

In [31]:
df1

    0     1     2
0  삼성  2000  스마트폰
1  현대  2500   자동차
2  금성  3000   건조기

In [34]:
# 컬럼 제목 만들기
df1.columns = ['기업명', '매출액', '업종']

In [36]:
df1

  기업명   매출액    업종
0  삼성  2000  스마트폰
1  현대  2500   자동차
2  금성  3000   건조기

In [40]:
df2 = pd.DataFrame(company1, columns=['기업명', '매출액', '업종'])
df2

  기업명   매출액    업종
0  삼성  2000  스마트폰
1  현대  2500   자동차
2  금성  3000   건조기

In [42]:
# 방법2. dict로 만들기 - key:value로 정의

In [44]:
company2 = {'기업명' : ['삼성','현대','금성'],
            '매출액' : [2000,2500,3000],
            '업종' : ['스마트폰','자동차','건조기']
           }

In [47]:
df2 = pd.DataFrame(company2)
df2

  기업명   매출액    업종
0  삼성  2000  스마트폰
1  현대  2500   자동차
2  금성  3000   건조기

In [49]:
# 특정 column으로 index를 지정

In [51]:
df1

  기업명   매출액    업종
0  삼성  2000  스마트폰
1  현대  2500   자동차
2  금성  3000   건조기

In [54]:
df1.index = df1['기업명']
df1

    기업명   매출액    업종
기업명
삼성   삼성  2000  스마트폰
현대   현대  2500   자동차
금성   금성  3000   건조기

In [56]:
# series : column 1개 확인하기
df1['매출액']

기업명
삼성    2000
현대    2500
금성    3000
Name: 매출액, dtype: int64

In [58]:
type(df1['매출액'])

pandas.core.series.Series

In [59]:
# 문제1 : 다음의 정보를 데이터 프레임으로 만들기

In [66]:
bts = [ ['진', '서브보컬', 28],
        ['슈가', '리드래퍼', 28],
        ['제이홉', '서브래퍼', 28],
        ['RM', '리더', 28],
        ['지민', '리드보컬', 28],
        ['뷔', '리드댄서', 28],
        ['정국', '리드댄서', 28],
      ]
pd.DataFrame(bts, columns=['이름', '포지션', '나이'])

    이름   포지션  나이
0    진  서브보컬  28
1   슈가  리드래퍼  28
2  제이홉  서브래퍼  28
3   RM    리더  28
4   지민  리드보컬  28
5    뷔  리드댄서  28
6   정국  리드댄서  28

In [68]:
# 문제2 : 데이터 프레임 만들기

In [83]:
a = np.arange(1, 40, 2)
a

array([ 1,  3,  5,  7,  9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33,
       35, 37, 39])

In [88]:
a = a.reshape(-1,4)
a

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23],
       [25, 27, 29, 31],
       [33, 35, 37, 39]])

In [95]:
a = pd.DataFrame(a, columns=['1열','2열','3열','4열'])
a

   1열  2열  3열  4열
0   1   3   5   7
1   9  11  13  15
2  17  19  21  23
3  25  27  29  31
4  33  35  37  39

In [97]:
a['1열']

0     1
1     9
2    17
3    25
4    33
Name: 1열, dtype: int32

In [98]:
a[['1열','3열']]

   1열  3열
0   1   5
1   9  13
2  17  21
3  25  29
4  33  37